app/controllers/todos_controller.rb

  def index
    @todos = Todo.all.order(deadline: :asc)
---
SELECT "todos".* FROM "todos" ORDER BY "todos"."deadline" DESC

  def show
    @todo = Todo.find_by(id: params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @todo = Todo.new(
      content: params[:content],
      user_id: current_user.id,
      deadline: params[:deadline],
      status: 0
    )
    @todo.save
---
INSERT INTO "todos" ("content", "created_at", "updated_at", "user_id", "deadline", "status") VALUES (?, ?, ?, ?, ?, ?)  [["content", "test_status"], ["created_at", "2020-08-27 01:31:33.223449"], ["updated_at", "2020-08-27 01:31:33.223449"], ["user_id", 7], ["deadline", "2020-08-28 00:00:00"], ["status", 0]]

  def edit
    @todo = Todo.find_by(id: params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

  def update
    @todo = Todo.find_by(id: params[:id])
    @todo.content = params[:content]
    @todo.deadline = params[:deadline]
    @todo.status = params[:status]
    @todo.save
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "todos" SET "deadline" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["deadline", "2020-09-04 00:00:00"], ["updated_at", "2020-09-04 02:01:49.230711"], ["id", 27]]

  def destroy
    @todo = Todo.find_by(id: params[:id])
    @todo.destroy
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 11]]