app/controllers/users_controller.rb

  def update
    @user = User.find_by(id: params[:id])
    @user.username = params[:username]
    @user.email = params[:email]
    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", nil], ["updated_at", "2020-08-25 05:10:11.491948"], ["id", 7]]